app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twtter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@friend = Friend.new(friend_params)
    @friend= current_user.friends.build(friend_params)
    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "phone" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["phone", "00099991231"], ["updated_at", "2021-12-26 19:26:32.610210"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)

SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def auth
    if current_user!=nil
      @friend= current_user.friends.find_by(id: params[:id])